test/data/xml/axis/RelativeMove.Request.xml

<?xml version="1.0" encoding="UTF-8"?>
<s:Envelope 
  xmlns:s="http://www.w3.org/2003/05/soap-envelope" 
  xmlns:env="http://www.w3.org/2003/05/soap-envelope " 
  xmlns:ter="http://www.onvif.org/ver10/error" 
  xmlns:xs="http://www.w3.org/2001/XMLSchema" 
  xmlns:tt="http://www.onvif.org/ver10/schema" 
  xmlns:tptz="http://www.onvif.org/ver20/ptz/wsdl">
  <s:Header>
    <Security s:mustUnderstand="1" 
      xmlns="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd">
      <UsernameToken>
        <Username>root</Username>
        <Password Type="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-username-token-profile-1.0#PasswordDigest">XyK3cTIc7bXCsaAIePwt0vVg2oo=</Password>
        <Nonce EncodingType="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-soap-message-security-1.0#Base64Binary">MuWKyv750wvczI4aMWZBww==</Nonce>
        <Created 
          xmlns="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd">2018-02-18T15:53:50.356Z
        </Created>
      </UsernameToken>
    </Security>
  </s:Header>
  <s:Body>
    <tptz:RelativeMove>
      <tptz:ProfileToken>profile_1_h264</tptz:ProfileToken>
      <tptz:Translation>
        <tt:PanTilt x="0.1" y="0.3"/>
        <tt:Zoom x="0"/>
      </tptz:Translation>
    </tptz:RelativeMove>
  </s:Body>
</s:Envelope>